//=============================================================================
//! \file     Graphics.h
//!
//! \brief    Библиотека Тупого Художника (The Dumb Artist Library).\n
//! \brief    Обертка (wrapper) для главного файла (TXLib.h)
//!
//! \version  [Version 0.01 alpha, build 71]
//! \author   Ded
//! \date     2005
//!
//=============================================================================

#ifndef __TX_GRAPHICS_H
#define __TX_GRAPHICS_H

//=============================================================================

#include "TXLib.h"

//=============================================================================

void txMain();

//-----------------------------------------------------------------------------
//! \brief   Главная функция - с нее начинается исполнение программы.
//! \return  Целое число, обычно 0 :)

int main()
    {
    txMain();
    return 0;
    }

//-----------------------------------------------------------------------------
//! \cond Internal

#define main txMain

// Prior build 50 compatibility
#define txSetBkColor txSetFillColor
#define txBkColor    txFillColor
#define txGetBkColor txGetFillColor

//! \endcond

//=============================================================================

#endif // __TX_GRAPHICS_H

//=============================================================================
